Revit 2024 API
SystemsAnalysisOptions Members
The SystemsAnalysisOptions type exposes the following members.
Constructors
Name | Description
SystemsAnalysisOptions
 Constructs a new instance of the options.
Methods
Name | Description
Dispose
Releases all resources used by the SystemsAnalysisOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OutputFolder
 The path of the output folder for systems analysis.
WeatherFile
 The file name of the EnergyPlus weather (*.epw).
WorkflowFile
 The file name of the EnergyPlus workflow script.
See Also
SystemsAnalysisOptions Class
Autodesk.Revit.DB.Analysis Namespace